
/*
 * —оздать класс Airline, спецификаци€ которого приведена ниже. ќпределить конструкторы, set- и get- методы
и метод toString(). —оздать второй класс, агрегирующий массив типа Airline, с подход€щими конструкторами и
методами. «адать критерии выбора данных и вывести эти данные на консоль.
Airline: пункт назначени€, номер рейса, тип самолета, врем€ вылета, дни недели.
Ќайти и вывести:
a) список рейсов дл€ заданного пункта назначени€;
b) список рейсов дл€ заданного дн€ недели;
c) список рейсов дл€ заданного дн€ недели, врем€ вылета дл€ которых больше заданного.
 */

/*
 * Ќе совсем пон€тно что понимаетс€ по "типом самолЄта": турбореактивный/турбовинтовой/винтовой, пассажирский/грузовой, ближне-/средне-/дальнемагистральный и т.д.
 * ѕоэтому п од типом самолЄта будем понимать модель самолЄта, например Airbus A380 или Boeing 787
 * 
 */

package by.epam.java.classes.simplest_classes_10;

public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
